5.Miscellaneous/Hall_Implementation_openFOAM/Z1flatanalytical/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
          type            kqRwallFunction; 
          value           uniform 0; 
    }
    
	topWall
    {
          type            kqRwallFunction; 
          value           uniform 0; 
    }
    
	sides1
    {
        type            cyclic;
    }
	
    sides2
    {
        type            cyclic;
    }

    outlet
    {
        type            calculated;
		value		    uniform 0;
	}
	
    inlet
    {
        type            calculated;
		value		    uniform 0;
    }
}


// ************************************************************************* //
